use sciman;

# default users
insert into user(username, password) values
('hack', 'hack'),
('admin', 'admin@123');

# sample data
INSERT INTO laboratory (name, orientation) VALUES
('蔚蓝实验室', '在食品科学领域进行研究，关注食品安全和营养品质'),
('幽谷实验室', '研究社会学，深入分析社会结构和社会变革的影响'),
('烟雨实验室', '专注于大气科学研究，研究大气环境和气候变化'),
('流星实验室', '从事地球物理学研究，关注地球内部结构和地震活动'),
('橙光实验室', '在光电子材料研究领域进行创新，探索新型光电子器件'),
('琴韵实验室', '研究音乐学和音响工程，致力于音乐艺术和声学技术的结合'),
('橙影实验室', '在机器人工程领域进行研究，开发智能机器人和自动化系统'),
('桃花源实验室', '研究地理信息科学，关注地理信息系统和遥感技术的应用'),
('星河实验室', '从事物理学研究，深入探讨基本粒子和物质的性质'),
('秋水实验室', '专注于水资源科学研究，研究水循环和水资源管理'),
('翎羽实验室', '研究生物信息学，关注生物大数据和基因组学的分析'),
('朝霞实验室', '在教育科学领域进行研究，推动教育改革和创新'),
('青松实验室', '研究植物生态学，关注植物生长和生态系统的相互作用');

