use sciman;

# default users
insert into user(username, password) values
('hack', 'hack'),
('admin', 'admin@123');

# sample data
INSERT INTO laboratory (name, orientation) VALUES
('翠峰实验室', '在人工智能研究领域致力于深度学习和神经网络的创新和应用'),
('沧海实验室', '专注于生物技术领域，研究生命科学和生物医学工程的最新技术和发展'),
('青云实验室', '从事环境科学研究，关注大气、水体和土壤的生态平衡和环境保护'),
('紫翼实验室', '探索材料科学研究，致力于新型材料的合成、性能优化和应用开发'),
('明月实验室', '在社会科学领域进行研究，深入探讨社会变革、人类行为和文化传承'),
('静谧实验室', '致力于医学研究，关注疾病治疗和健康管理的创新方法'),
('碧波实验室', '研究化学工程与材料科学，专注于新型化合物的设计与合成'),
('金秋实验室', '在农业科学领域开展研究，关注粮食生产和农业可持续发展'),
('幻影实验室', '专注于虚拟现实和增强现实技术研究，探索应用于教育和娱乐的可能性'),
('雪峰实验室', '研究地球科学，关注地球变化、自然灾害和资源利用'),
('晨曦实验室', '从事心理学研究，深入研究人类思维和行为的心理机制'),
('翩翩实验室', '在艺术与设计领域进行创新研究，推动文化创意产业的发展'),
('蓝天实验室', '专注于能源科学与工程，研究可再生能源和能源转换技术'),
('峰回实验室', '从事机械工程研究，关注先进制造技术和机械系统优化'),
('水晶实验室', '研究光学与光电子技术，致力于光学材料和器件的创新应用'),
('鸿蒙实验室', '在信息技术领域进行研究，关注人工智能、大数据和物联网'),
('云端实验室', '专注于计算机科学研究，研发新型算法和计算模型'),
('绿野实验室', '研究生态学，关注生态系统结构和生物多样性的保护'),
('星辰实验室', '从事天文学研究，研究星体和宇宙的形成演化'),
('蔚蓝实验室', '在食品科学领域进行研究，关注食品安全和营养品质'),
('幽谷实验室', '研究社会学，深入分析社会结构和社会变革的影响'),
('烟雨实验室', '专注于大气科学研究，研究大气环境和气候变化'),
('流星实验室', '从事地球物理学研究，关注地球内部结构和地震活动'),
('橙光实验室', '在光电子材料研究领域进行创新，探索新型光电子器件'),
('琴韵实验室', '研究音乐学和音响工程，致力于音乐艺术和声学技术的结合'),
('橙影实验室', '在机器人工程领域进行研究，开发智能机器人和自动化系统'),
('桃花源实验室', '研究地理信息科学，关注地理信息系统和遥感技术的应用'),
('星河实验室', '从事物理学研究，深入探讨基本粒子和物质的性质'),
('秋水实验室', '专注于水资源科学研究，研究水循环和水资源管理'),
('翎羽实验室', '研究生物信息学，关注生物大数据和基因组学的分析'),
('朝霞实验室', '在教育科学领域进行研究，推动教育改革和创新'),
('青松实验室', '研究植物生态学，关注植物生长和生态系统的相互作用');

